Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 28, 28, 1)    0                                            
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 28, 28, 16)   160         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 28, 28, 16)   64          conv2d_23[0][0]                  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 28, 28, 16)   0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 28, 28, 16)   272         activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 28, 28, 16)   64          conv2d_24[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 28, 28, 16)   0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 28, 28, 16)   2320        activation_21[0][0]              
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 28, 28, 16)   64          conv2d_25[0][0]                  
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 28, 28, 16)   0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 28, 28, 64)   1088        activation_20[0][0]              
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 28, 28, 64)   1088        activation_22[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 28, 28, 64)   0           conv2d_27[0][0]                  
                                                                 conv2d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 28, 28, 64)   256         add_7[0][0]                      
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 28, 28, 64)   0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 28, 28, 16)   1040        activation_23[0][0]              
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 28, 28, 16)   64          conv2d_28[0][0]                  
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 28, 28, 16)   0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 28, 28, 16)   2320        activation_24[0][0]              
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 28, 28, 16)   64          conv2d_29[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 28, 28, 16)   0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 28, 28, 64)   1088        activation_25[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 28, 28, 64)   0           add_7[0][0]                      
                                                                 conv2d_30[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 28, 28, 64)   256         add_8[0][0]                      
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 28, 28, 64)   0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 28, 28, 16)   1040        activation_26[0][0]              
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 28, 28, 16)   64          conv2d_31[0][0]                  
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 28, 28, 16)   0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 28, 28, 16)   2320        activation_27[0][0]              
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 28, 28, 16)   64          conv2d_32[0][0]                  
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 28, 28, 16)   0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 28, 28, 64)   1088        activation_28[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, 28, 28, 64)   0           add_8[0][0]                      
                                                                 conv2d_33[0][0]                  
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 28, 28, 64)   256         add_9[0][0]                      
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 28, 28, 64)   0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 28, 28, 16)   1040        activation_29[0][0]              
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 28, 28, 16)   64          conv2d_34[0][0]                  
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 28, 28, 16)   0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 28, 28, 16)   2320        activation_30[0][0]              
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 28, 28, 16)   64          conv2d_35[0][0]                  
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 28, 28, 16)   0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 28, 28, 64)   1088        activation_31[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, 28, 28, 64)   0           add_9[0][0]                      
                                                                 conv2d_36[0][0]                  
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 28, 28, 64)   256         add_10[0][0]                     
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 28, 28, 64)   0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 28, 28, 16)   1040        activation_32[0][0]              
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 28, 28, 16)   64          conv2d_37[0][0]                  
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 28, 28, 16)   0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 28, 28, 16)   2320        activation_33[0][0]              
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 28, 28, 16)   64          conv2d_38[0][0]                  
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 28, 28, 16)   0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 28, 28, 64)   1088        activation_34[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, 28, 28, 64)   0           add_10[0][0]                     
                                                                 conv2d_39[0][0]                  
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 28, 28, 64)   256         add_11[0][0]                     
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 28, 28, 64)   0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 28, 28, 16)   1040        activation_35[0][0]              
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 28, 28, 16)   64          conv2d_40[0][0]                  
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 28, 28, 16)   0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 28, 28, 16)   2320        activation_36[0][0]              
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 28, 28, 16)   64          conv2d_41[0][0]                  
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 28, 28, 16)   0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 28, 28, 64)   1088        activation_37[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, 28, 28, 64)   0           add_11[0][0]                     
                                                                 conv2d_42[0][0]                  
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 28, 28, 64)   256         add_12[0][0]                     
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 28, 28, 64)   0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 14, 14, 64)   4160        activation_38[0][0]              
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 14, 14, 64)   256         conv2d_43[0][0]                  
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 14, 14, 64)   0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 14, 14, 64)   36928       activation_39[0][0]              
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 14, 14, 64)   256         conv2d_44[0][0]                  
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 14, 14, 64)   0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 14, 14, 128)  8320        add_12[0][0]                     
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 14, 14, 128)  8320        activation_40[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, 14, 14, 128)  0           conv2d_46[0][0]                  
                                                                 conv2d_45[0][0]                  
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 14, 14, 128)  512         add_13[0][0]                     
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 14, 14, 128)  0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 14, 14, 64)   8256        activation_41[0][0]              
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 14, 14, 64)   256         conv2d_47[0][0]                  
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 14, 14, 64)   0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 14, 14, 64)   36928       activation_42[0][0]              
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 14, 14, 64)   256         conv2d_48[0][0]                  
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 14, 14, 64)   0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 14, 14, 128)  8320        activation_43[0][0]              
__________________________________________________________________________________________________
add_14 (Add)                    (None, 14, 14, 128)  0           add_13[0][0]                     
                                                                 conv2d_49[0][0]                  
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 14, 14, 128)  512         add_14[0][0]                     
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 14, 14, 128)  0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 14, 14, 64)   8256        activation_44[0][0]              
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 14, 14, 64)   256         conv2d_50[0][0]                  
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 14, 14, 64)   0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 14, 14, 64)   36928       activation_45[0][0]              
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 14, 14, 64)   256         conv2d_51[0][0]                  
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 14, 14, 64)   0           batch_normalization_46[0][0]     
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 14, 14, 128)  8320        activation_46[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, 14, 14, 128)  0           add_14[0][0]                     
                                                                 conv2d_52[0][0]                  
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 14, 14, 128)  512         add_15[0][0]                     
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 14, 14, 128)  0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 14, 14, 64)   8256        activation_47[0][0]              
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 14, 14, 64)   256         conv2d_53[0][0]                  
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 14, 14, 64)   0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 14, 14, 64)   36928       activation_48[0][0]              
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 14, 14, 64)   256         conv2d_54[0][0]                  
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 14, 14, 64)   0           batch_normalization_49[0][0]     
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 14, 14, 128)  8320        activation_49[0][0]              
__________________________________________________________________________________________________
add_16 (Add)                    (None, 14, 14, 128)  0           add_15[0][0]                     
                                                                 conv2d_55[0][0]                  
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (None, 14, 14, 128)  512         add_16[0][0]                     
__________________________________________________________________________________________________
activation_50 (Activation)      (None, 14, 14, 128)  0           batch_normalization_50[0][0]     
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 14, 14, 64)   8256        activation_50[0][0]              
__________________________________________________________________________________________________
batch_normalization_51 (BatchNo (None, 14, 14, 64)   256         conv2d_56[0][0]                  
__________________________________________________________________________________________________
activation_51 (Activation)      (None, 14, 14, 64)   0           batch_normalization_51[0][0]     
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 14, 14, 64)   36928       activation_51[0][0]              
__________________________________________________________________________________________________
batch_normalization_52 (BatchNo (None, 14, 14, 64)   256         conv2d_57[0][0]                  
__________________________________________________________________________________________________
activation_52 (Activation)      (None, 14, 14, 64)   0           batch_normalization_52[0][0]     
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 14, 14, 128)  8320        activation_52[0][0]              
__________________________________________________________________________________________________
add_17 (Add)                    (None, 14, 14, 128)  0           add_16[0][0]                     
                                                                 conv2d_58[0][0]                  
__________________________________________________________________________________________________
batch_normalization_53 (BatchNo (None, 14, 14, 128)  512         add_17[0][0]                     
__________________________________________________________________________________________________
activation_53 (Activation)      (None, 14, 14, 128)  0           batch_normalization_53[0][0]     
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 14, 14, 64)   8256        activation_53[0][0]              
__________________________________________________________________________________________________
batch_normalization_54 (BatchNo (None, 14, 14, 64)   256         conv2d_59[0][0]                  
__________________________________________________________________________________________________
activation_54 (Activation)      (None, 14, 14, 64)   0           batch_normalization_54[0][0]     
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 14, 14, 64)   36928       activation_54[0][0]              
__________________________________________________________________________________________________
batch_normalization_55 (BatchNo (None, 14, 14, 64)   256         conv2d_60[0][0]                  
__________________________________________________________________________________________________
activation_55 (Activation)      (None, 14, 14, 64)   0           batch_normalization_55[0][0]     
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 14, 14, 128)  8320        activation_55[0][0]              
__________________________________________________________________________________________________
add_18 (Add)                    (None, 14, 14, 128)  0           add_17[0][0]                     
                                                                 conv2d_61[0][0]                  
__________________________________________________________________________________________________
batch_normalization_56 (BatchNo (None, 14, 14, 128)  512         add_18[0][0]                     
__________________________________________________________________________________________________
activation_56 (Activation)      (None, 14, 14, 128)  0           batch_normalization_56[0][0]     
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 7, 7, 128)    16512       activation_56[0][0]              
__________________________________________________________________________________________________
batch_normalization_57 (BatchNo (None, 7, 7, 128)    512         conv2d_62[0][0]                  
__________________________________________________________________________________________________
activation_57 (Activation)      (None, 7, 7, 128)    0           batch_normalization_57[0][0]     
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 7, 7, 128)    147584      activation_57[0][0]              
__________________________________________________________________________________________________
batch_normalization_58 (BatchNo (None, 7, 7, 128)    512         conv2d_63[0][0]                  
__________________________________________________________________________________________________
activation_58 (Activation)      (None, 7, 7, 128)    0           batch_normalization_58[0][0]     
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 7, 7, 256)    33024       add_18[0][0]                     
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 7, 7, 256)    33024       activation_58[0][0]              
__________________________________________________________________________________________________
add_19 (Add)                    (None, 7, 7, 256)    0           conv2d_65[0][0]                  
                                                                 conv2d_64[0][0]                  
__________________________________________________________________________________________________
batch_normalization_59 (BatchNo (None, 7, 7, 256)    1024        add_19[0][0]                     
__________________________________________________________________________________________________
activation_59 (Activation)      (None, 7, 7, 256)    0           batch_normalization_59[0][0]     
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 7, 7, 128)    32896       activation_59[0][0]              
__________________________________________________________________________________________________
batch_normalization_60 (BatchNo (None, 7, 7, 128)    512         conv2d_66[0][0]                  
__________________________________________________________________________________________________
activation_60 (Activation)      (None, 7, 7, 128)    0           batch_normalization_60[0][0]     
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 7, 7, 128)    147584      activation_60[0][0]              
__________________________________________________________________________________________________
batch_normalization_61 (BatchNo (None, 7, 7, 128)    512         conv2d_67[0][0]                  
__________________________________________________________________________________________________
activation_61 (Activation)      (None, 7, 7, 128)    0           batch_normalization_61[0][0]     
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 7, 7, 256)    33024       activation_61[0][0]              
__________________________________________________________________________________________________
add_20 (Add)                    (None, 7, 7, 256)    0           add_19[0][0]                     
                                                                 conv2d_68[0][0]                  
__________________________________________________________________________________________________
batch_normalization_62 (BatchNo (None, 7, 7, 256)    1024        add_20[0][0]                     
__________________________________________________________________________________________________
activation_62 (Activation)      (None, 7, 7, 256)    0           batch_normalization_62[0][0]     
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 7, 7, 128)    32896       activation_62[0][0]              
__________________________________________________________________________________________________
batch_normalization_63 (BatchNo (None, 7, 7, 128)    512         conv2d_69[0][0]                  
__________________________________________________________________________________________________
activation_63 (Activation)      (None, 7, 7, 128)    0           batch_normalization_63[0][0]     
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 7, 7, 128)    147584      activation_63[0][0]              
__________________________________________________________________________________________________
batch_normalization_64 (BatchNo (None, 7, 7, 128)    512         conv2d_70[0][0]                  
__________________________________________________________________________________________________
activation_64 (Activation)      (None, 7, 7, 128)    0           batch_normalization_64[0][0]     
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 7, 7, 256)    33024       activation_64[0][0]              
__________________________________________________________________________________________________
add_21 (Add)                    (None, 7, 7, 256)    0           add_20[0][0]                     
                                                                 conv2d_71[0][0]                  
__________________________________________________________________________________________________
batch_normalization_65 (BatchNo (None, 7, 7, 256)    1024        add_21[0][0]                     
__________________________________________________________________________________________________
activation_65 (Activation)      (None, 7, 7, 256)    0           batch_normalization_65[0][0]     
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 7, 7, 128)    32896       activation_65[0][0]              
__________________________________________________________________________________________________
batch_normalization_66 (BatchNo (None, 7, 7, 128)    512         conv2d_72[0][0]                  
__________________________________________________________________________________________________
activation_66 (Activation)      (None, 7, 7, 128)    0           batch_normalization_66[0][0]     
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 7, 7, 128)    147584      activation_66[0][0]              
__________________________________________________________________________________________________
batch_normalization_67 (BatchNo (None, 7, 7, 128)    512         conv2d_73[0][0]                  
__________________________________________________________________________________________________
activation_67 (Activation)      (None, 7, 7, 128)    0           batch_normalization_67[0][0]     
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 7, 7, 256)    33024       activation_67[0][0]              
__________________________________________________________________________________________________
add_22 (Add)                    (None, 7, 7, 256)    0           add_21[0][0]                     
                                                                 conv2d_74[0][0]                  
__________________________________________________________________________________________________
batch_normalization_68 (BatchNo (None, 7, 7, 256)    1024        add_22[0][0]                     
__________________________________________________________________________________________________
activation_68 (Activation)      (None, 7, 7, 256)    0           batch_normalization_68[0][0]     
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 7, 7, 128)    32896       activation_68[0][0]              
__________________________________________________________________________________________________
batch_normalization_69 (BatchNo (None, 7, 7, 128)    512         conv2d_75[0][0]                  
__________________________________________________________________________________________________
activation_69 (Activation)      (None, 7, 7, 128)    0           batch_normalization_69[0][0]     
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 7, 7, 128)    147584      activation_69[0][0]              
__________________________________________________________________________________________________
batch_normalization_70 (BatchNo (None, 7, 7, 128)    512         conv2d_76[0][0]                  
__________________________________________________________________________________________________
activation_70 (Activation)      (None, 7, 7, 128)    0           batch_normalization_70[0][0]     
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 7, 7, 256)    33024       activation_70[0][0]              
__________________________________________________________________________________________________
add_23 (Add)                    (None, 7, 7, 256)    0           add_22[0][0]                     
                                                                 conv2d_77[0][0]                  
__________________________________________________________________________________________________
batch_normalization_71 (BatchNo (None, 7, 7, 256)    1024        add_23[0][0]                     
__________________________________________________________________________________________________
activation_71 (Activation)      (None, 7, 7, 256)    0           batch_normalization_71[0][0]     
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 7, 7, 128)    32896       activation_71[0][0]              
__________________________________________________________________________________________________
batch_normalization_72 (BatchNo (None, 7, 7, 128)    512         conv2d_78[0][0]                  
__________________________________________________________________________________________________
activation_72 (Activation)      (None, 7, 7, 128)    0           batch_normalization_72[0][0]     
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 7, 7, 128)    147584      activation_72[0][0]              
__________________________________________________________________________________________________
batch_normalization_73 (BatchNo (None, 7, 7, 128)    512         conv2d_79[0][0]                  
__________________________________________________________________________________________________
activation_73 (Activation)      (None, 7, 7, 128)    0           batch_normalization_73[0][0]     
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 7, 7, 256)    33024       activation_73[0][0]              
__________________________________________________________________________________________________
add_24 (Add)                    (None, 7, 7, 256)    0           add_23[0][0]                     
                                                                 conv2d_80[0][0]                  
__________________________________________________________________________________________________
batch_normalization_74 (BatchNo (None, 7, 7, 256)    1024        add_24[0][0]                     
__________________________________________________________________________________________________
activation_74 (Activation)      (None, 7, 7, 256)    0           batch_normalization_74[0][0]     
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 12544)        0           activation_74[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           125450      flatten_2[0][0]                  
==================================================================================================
Total params: 1,796,330
Trainable params: 1,785,930
Non-trainable params: 10,400
__________________________________________________________________________________________________
