Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 28, 28, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 16)   160         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 28, 28, 16)   64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 28, 28, 16)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 28, 28, 16)   272         activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 28, 28, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 28, 28, 16)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 28, 28, 16)   2320        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 28, 28, 16)   64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 28, 28, 16)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 28, 28, 64)   1088        activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 28, 28, 64)   1088        activation_3[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 28, 28, 64)   0           conv2d_5[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 28, 28, 64)   256         add_1[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 28, 28, 64)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 28, 28, 16)   1040        activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 28, 28, 16)   64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 28, 28, 16)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 28, 28, 16)   2320        activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 28, 28, 16)   64          conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 28, 28, 16)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 28, 28, 64)   1088        activation_6[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, 28, 28, 64)   0           add_1[0][0]                      
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 28, 28, 64)   256         add_2[0][0]                      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 28, 28, 64)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 14, 14, 64)   4160        activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 14, 14, 64)   256         conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 14, 14, 64)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 14, 14, 64)   36928       activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 14, 14, 64)   256         conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 14, 14, 64)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 14, 14, 128)  8320        add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 14, 14, 128)  8320        activation_9[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, 14, 14, 128)  0           conv2d_12[0][0]                  
                                                                 conv2d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 14, 14, 128)  512         add_3[0][0]                      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 14, 14, 128)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 14, 14, 64)   8256        activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 14, 14, 64)   256         conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 14, 14, 64)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 14, 14, 64)   36928       activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 14, 14, 64)   256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 14, 14, 64)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 14, 14, 128)  8320        activation_12[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 14, 14, 128)  0           add_3[0][0]                      
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 14, 14, 128)  512         add_4[0][0]                      
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 14, 14, 128)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 7, 7, 128)    16512       activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 7, 7, 128)    512         conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 7, 7, 128)    0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 7, 7, 128)    147584      activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 7, 7, 128)    512         conv2d_17[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 7, 7, 128)    0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 7, 7, 256)    33024       add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 7, 7, 256)    33024       activation_15[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 7, 7, 256)    0           conv2d_19[0][0]                  
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 7, 7, 256)    1024        add_5[0][0]                      
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 7, 7, 256)    0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 7, 7, 128)    32896       activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 7, 7, 128)    512         conv2d_20[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 7, 7, 128)    0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 7, 7, 128)    147584      activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 7, 7, 128)    512         conv2d_21[0][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 7, 7, 128)    0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 7, 7, 256)    33024       activation_18[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 7, 7, 256)    0           add_5[0][0]                      
                                                                 conv2d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 7, 7, 256)    1024        add_6[0][0]                      
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 7, 7, 256)    0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 12544)        0           activation_19[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           125450      flatten_1[0][0]                  
==================================================================================================
Total params: 696,682
Trainable params: 693,194
Non-trainable params: 3,488
__________________________________________________________________________________________________
